chat/backend/app/controllers/messages_controller.rb

    def index
    #このroom_idパラメータはどう渡される？？
    # indexを起動（？）するときに受け渡すんか？
      room = Room.find(params[:room_id])
    # room = Room.find(1)
    # だったら1をもってくるんか？？
      messages = room.messages.limit(20)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? LIMIT ?  [["room_id", 1], ["LIMIT", 20]]

    def create
      room = Room.find(params[:room_id])
      message = room.messages.create(message_params)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "sender_name", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hello"], ["sender_name", "John"], ["room_id", 1], ["created_at", "2023-09-20 04:28:11.567225"], ["updated_at", "2023-09-20 04:28:11.567225"]]