chat/backend/app/controllers/rooms_controller.rb

    def index
    #Room は　ルームモデルのclass名
      rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

    def create
        #room_params。。。？
      room = Room.create(room_params)
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "TestRoom1"], ["created_at", "2023-09-19 10:27:16.846847"], ["updated_at", "2023-09-19 10:27:16.846847"]]